[Killed] BlockStatement
thiagobustamante/node-eventstore/src/event-store.ts:15:78
     private persistenceProvider: PersistenceProvider;
     private storePublisher: Publisher;
 
-    public constructor(provider: PersistenceProvider, publisher?: Publisher) {
-        this.persistenceProvider = provider;
-        this.storePublisher = publisher;
-    }
+    public constructor(provider: PersistenceProvider, publisher?: Publisher) {}
 
     public get provider(): PersistenceProvider {

[Killed] BlockStatement
thiagobustamante/node-eventstore/src/event-store.ts:21:48
     }
 
     public get provider(): PersistenceProvider {
-        if (_.isNil(this.persistenceProvider)) {
-            throw new Error('No Provider configured in EventStore.');
-        }
+        if (_.isNil(this.persistenceProvider)) {}
         return this.persistenceProvider;
     }

[Killed] ConditionalExpression
thiagobustamante/node-eventstore/src/event-store.ts:21:13
     }
 
     public get provider(): PersistenceProvider {
-        if (_.isNil(this.persistenceProvider)) {
+        if (true) {
             throw new Error('No Provider configured in EventStore.');
         }

[Killed] StringLiteral
thiagobustamante/node-eventstore/src/event-store.ts:22:29
 
     public get provider(): PersistenceProvider {
         if (_.isNil(this.persistenceProvider)) {
-            throw new Error('No Provider configured in EventStore.');
+            throw new Error("");
         }
         return this.persistenceProvider;

[Killed] ConditionalExpression
thiagobustamante/node-eventstore/src/event-store.ts:50:13
      * @return A subscription. Can be used to remove the subscription to the publisher channel.
      */
     public subscribe(aggregation: string, subscriber: Subscriber): Promise<Subscription> {
-        if (this.publisher && (this.publisher as HasSubscribers).subscribe) {
+        if (false) {
             return (this.publisher as HasSubscribers).subscribe(aggregation, subscriber);
         }

[Killed] ConditionalExpression
thiagobustamante/node-eventstore/src/event-store.ts:50:13
      * @return A subscription. Can be used to remove the subscription to the publisher channel.
      */
     public subscribe(aggregation: string, subscriber: Subscriber): Promise<Subscription> {
-        if (this.publisher && (this.publisher as HasSubscribers).subscribe) {
+        if (true) {
             return (this.publisher as HasSubscribers).subscribe(aggregation, subscriber);
         }

[Killed] BlockStatement
thiagobustamante/node-eventstore/src/event-store.ts:63:67
      * @param limit The desired quantity aggregations
      * @return The aggregation list
      */
-    public async getAggregations(offset?: number, limit?: number) {
-        return this.provider.getAggregations(offset, limit);
-    }
+    public async getAggregations(offset?: number, limit?: number) {}
 
     /**

[Killed] BlockStatement
thiagobustamante/node-eventstore/src/event-store.ts:74:83
      * @param limit The desired quantity streams
      * @return The stream list
      */
-    public async getStreams(aggregation: string, offset?: number, limit?: number) {
-        return this.provider.getStreams(aggregation, offset, limit);
-    }
+    public async getStreams(aggregation: string, offset?: number, limit?: number) {}
 }
 
