[Killed] BlockStatement
thiagobustamante/node-eventstore/src/event-stream.ts:14:64
     private stream: Stream;
     private eventStore: EventStore;
 
-    public constructor(eventStore: EventStore, stream: Stream) {
-        this.eventStore = eventStore;
-        this.stream = stream;
-    }
+    public constructor(eventStore: EventStore, stream: Stream) {}
 
     /**

[Killed] ConditionalExpression
thiagobustamante/node-eventstore/src/event-stream.ts:51:13
      */
     public async addEvent(data: any) {
         const addedEvent: Event = await this.getProvider().addEvent(this.stream, data);
-        if (this.eventStore.publisher) {
+        if (true) {
             await (this.eventStore.publisher as Publisher).publish({
                 event: addedEvent,

[Killed] ConditionalExpression
thiagobustamante/node-eventstore/src/event-stream.ts:51:13
      */
     public async addEvent(data: any) {
         const addedEvent: Event = await this.getProvider().addEvent(this.stream, data);
-        if (this.eventStore.publisher) {
+        if (false) {
             await (this.eventStore.publisher as Publisher).publish({
                 event: addedEvent,
