[Killed] LogicalOperator
node-eventstore/src/provider/memory.ts:26:51
 
     public async getEvents(stream: Stream, offset = 0, limit?: number) {
         const history = this.getEventsList(stream.aggregation, stream.id);
-        return _(history).drop(offset).take(limit || history.length).value();
+        return _(history).drop(offset).take(limit && history.length).value();
     }
 

[Killed] LogicalOperator
node-eventstore/src/provider/memory.ts:31:55
 
     public async getAggregations(offset = 0, limit?: number): Promise<Array<string>> {
         const keys = Array.from(this.store.keys());
-        return _(keys).sort().drop(offset).take(limit || this.store.size).value();
+        return _(keys).sort().drop(offset).take(limit && this.store.size).value();
     }
 

[Killed] ConditionalExpression
node-eventstore/src/provider/memory.ts:36:13
 
     public async getStreams(aggregation: string, offset = 0, limit?: number): Promise<Array<string>> {
         const streams = this.store.get(aggregation);
-        if (streams) {
+        if (false) {
             const keys = Array.from(streams.keys());
             return _(keys).sort().drop(offset).take(limit || this.store.size).value();

[Killed] BlockStatement
node-eventstore/src/provider/memory.ts:36:22
 
     public async getStreams(aggregation: string, offset = 0, limit?: number): Promise<Array<string>> {
         const streams = this.store.get(aggregation);
-        if (streams) {
-            const keys = Array.from(streams.keys());
-            return _(keys).sort().drop(offset).take(limit || this.store.size).value();
-        }
+        if (streams) {}
         return [];
     }

[Killed] LogicalOperator
node-eventstore/src/provider/memory.ts:38:59
         const streams = this.store.get(aggregation);
         if (streams) {
             const keys = Array.from(streams.keys());
-            return _(keys).sort().drop(offset).take(limit || this.store.size).value();
+            return _(keys).sort().drop(offset).take(limit && this.store.size).value();
         }
         return [];

[Killed] ConditionalExpression
node-eventstore/src/provider/memory.ts:45:13
 
     private getEventsList(aggregation: string, streamId: string) {
         let streams = this.store.get(aggregation);
-        if (!streams) {
+        if (true) {
             streams = new Map<string, Array<Event>>();
             this.store.set(aggregation, streams);

[Killed] ConditionalExpression
node-eventstore/src/provider/memory.ts:45:13
 
     private getEventsList(aggregation: string, streamId: string) {
         let streams = this.store.get(aggregation);
-        if (!streams) {
+        if (false) {
             streams = new Map<string, Array<Event>>();
             this.store.set(aggregation, streams);

[Killed] ConditionalExpression
node-eventstore/src/provider/memory.ts:50:13
             this.store.set(aggregation, streams);
         }
         let history = streams.get(streamId);
-        if (!history) {
+        if (false) {
             history = new Array<Event>();
             streams.set(streamId, history);

[Killed] ConditionalExpression
node-eventstore/src/provider/memory.ts:50:13
             this.store.set(aggregation, streams);
         }
         let history = streams.get(streamId);
-        if (!history) {
+        if (true) {
             history = new Array<Event>();
             streams.set(streamId, history);
