[Killed] BlockStatement
node-eventstore/src/provider/mongo.ts:16:30
     private countersCollection: Collection;
     private mongoClient: MongoClient;
 
-    constructor(url: string) {
-        this.mongoURL = url;
-    }
+    constructor(url: string) {}
 
     public async addEvent(stream: Stream, data: any) {

[Killed] BlockStatement
node-eventstore/src/provider/mongo.ts:31:32
         };
 
         const result = await events.insertOne(_.merge(event, { stream: stream }));
-        if (!result.result.ok) {
-            throw new Error('Error saving event into the store');
-        }
+        if (!result.result.ok) {}
 
         return event;

[Killed] BooleanLiteral
node-eventstore/src/provider/mongo.ts:31:13
         };
 
         const result = await events.insertOne(_.merge(event, { stream: stream }));
-        if (!result.result.ok) {
+        if (result.result.ok) {
             throw new Error('Error saving event into the store');
         }

[Killed] ObjectLiteral
node-eventstore/src/provider/mongo.ts:40:36
 
     public async getEvents(stream: Stream, offset = 0, limit = 0) {
         const events = await this.events();
-        const cursor = events.find({ 'stream.id': stream.id, 'stream.aggregation': stream.aggregation });
+        const cursor = events.find({});
         if (offset > 0) {
             cursor.skip(offset);

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:41:13
     public async getEvents(stream: Stream, offset = 0, limit = 0) {
         const events = await this.events();
         const cursor = events.find({ 'stream.id': stream.id, 'stream.aggregation': stream.aggregation });
-        if (offset > 0) {
+        if (true) {
             cursor.skip(offset);
         }

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:41:13
     public async getEvents(stream: Stream, offset = 0, limit = 0) {
         const events = await this.events();
         const cursor = events.find({ 'stream.id': stream.id, 'stream.aggregation': stream.aggregation });
-        if (offset > 0) {
+        if (false) {
             cursor.skip(offset);
         }

[Killed] BlockStatement
node-eventstore/src/provider/mongo.ts:44:24
         if (offset > 0) {
             cursor.skip(offset);
         }
-        if (limit > 0) {
-            cursor.limit(limit);
-        }
+        if (limit > 0) {}
 
         return await cursor.toArray();

[Killed] EqualityOperator
node-eventstore/src/provider/mongo.ts:44:19
         if (offset > 0) {
             cursor.skip(offset);
         }
-        if (limit > 0) {
+        if (limit >= 0) {
             cursor.limit(limit);
         }

[Killed] ObjectLiteral
node-eventstore/src/provider/mongo.ts:53:49
 
     public async getAggregations(offset = 0, limit = 0): Promise<Array<string>> {
         const events = await this.events();
-        const cursor = events.aggregate().group({ _id: '$stream.aggregation' });
+        const cursor = events.aggregate().group({});
 
         if (offset > 0) {

[Killed] EqualityOperator
node-eventstore/src/provider/mongo.ts:55:20
         const events = await this.events();
         const cursor = events.aggregate().group({ _id: '$stream.aggregation' });
 
-        if (offset > 0) {
+        if (offset <= 0) {
             cursor.skip(offset);
         }

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:55:13
         const events = await this.events();
         const cursor = events.aggregate().group({ _id: '$stream.aggregation' });
 
-        if (offset > 0) {
+        if (true) {
             cursor.skip(offset);
         }

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:58:13
         if (offset > 0) {
             cursor.skip(offset);
         }
-        if (limit > 0) {
+        if (false) {
             cursor.limit(limit);
         }

[Killed] StringLiteral
node-eventstore/src/provider/mongo.ts:68:22
     public async getStreams(aggregation: string, offset = 0, limit = 0): Promise<Array<string>> {
         const events = await this.events();
         const cursor = events.aggregate()
-            .match({ 'stream.aggregation': aggregation })
+            .match({ "": aggregation })
             .group({ _id: '$stream.id' });
 

[Killed] BlockStatement
node-eventstore/src/provider/mongo.ts:71:25
             .match({ 'stream.aggregation': aggregation })
             .group({ _id: '$stream.id' });
 
-        if (offset > 0) {
-            cursor.skip(offset);
-        }
+        if (offset > 0) {}
         if (limit > 0) {
             cursor.limit(limit);

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:86:13
     }
 
     private async events() {
-        if (!this.eventCollection) {
+        if (true) {
             const mongoClient = await this.getMongoClient();
             this.eventCollection = mongoClient.db().collection('events');

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:86:13
     }
 
     private async events() {
-        if (!this.eventCollection) {
+        if (false) {
             const mongoClient = await this.getMongoClient();
             this.eventCollection = mongoClient.db().collection('events');

[Killed] BooleanLiteral
node-eventstore/src/provider/mongo.ts:94:13
     }
 
     private async counters() {
-        if (!this.countersCollection) {
+        if (this.countersCollection) {
             const mongoClient = await this.getMongoClient();
             this.countersCollection = mongoClient.db().collection('counters');

[Killed] BlockStatement
node-eventstore/src/provider/mongo.ts:94:39
     }
 
     private async counters() {
-        if (!this.countersCollection) {
-            const mongoClient = await this.getMongoClient();
-            this.countersCollection = mongoClient.db().collection('counters');
-        }
+        if (!this.countersCollection) {}
         return this.countersCollection;
     }

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:102:13
     }
 
     private async getMongoClient() {
-        if (!this.mongoClient) {
+        if (false) {
             this.mongoClient = await MongoClient.connect(this.mongoURL, { useNewUrlParser: true });
         }

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:102:13
     }
 
     private async getMongoClient() {
-        if (!this.mongoClient) {
+        if (true) {
             this.mongoClient = await MongoClient.connect(this.mongoURL, { useNewUrlParser: true });
         }

[Killed] BooleanLiteral
node-eventstore/src/provider/mongo.ts:103:92
 
     private async getMongoClient() {
         if (!this.mongoClient) {
-            this.mongoClient = await MongoClient.connect(this.mongoURL, { useNewUrlParser: true });
+            this.mongoClient = await MongoClient.connect(this.mongoURL, { useNewUrlParser: false });
         }
         return this.mongoClient;

[Killed] ObjectLiteral
node-eventstore/src/provider/mongo.ts:103:73
 
     private async getMongoClient() {
         if (!this.mongoClient) {
-            this.mongoClient = await MongoClient.connect(this.mongoURL, { useNewUrlParser: true });
+            this.mongoClient = await MongoClient.connect(this.mongoURL, {});
         }
         return this.mongoClient;

[Killed] ObjectLiteral
node-eventstore/src/provider/mongo.ts:113:21
         const result = await counters.findOneAndUpdate(
             { _id: sequenceName },
             // eslint-disable-next-line @typescript-eslint/camelcase
-            { $inc: { sequence_value: 1 } },
+            { $inc: {} },
             {
                 returnOriginal: false,

[Killed] BooleanLiteral
node-eventstore/src/provider/mongo.ts:115:33
             // eslint-disable-next-line @typescript-eslint/camelcase
             { $inc: { sequence_value: 1 } },
             {
-                returnOriginal: false,
+                returnOriginal: true,
                 upsert: true
             });

[Killed] BooleanLiteral
node-eventstore/src/provider/mongo.ts:116:25
             { $inc: { sequence_value: 1 } },
             {
                 returnOriginal: false,
-                upsert: true
+                upsert: false
             });
 

[Killed] StringLiteral
node-eventstore/src/provider/mongo.ts:120:29
             });
 
         if (!result.ok) {
-            throw new Error('Error reading next sequence value');
+            throw new Error("");
         }
         return result.value.sequence_value;
