[Killed] BooleanLiteral
node-eventstore/src/provider/mysql.ts:12:27
  */
 export class MySQLProvider implements PersistenceProvider {
     private mysql: MySQL;
-    private initialized = false;
+    private initialized = true;
 
     constructor(config: MySQLConfig) {

[Killed] BlockStatement
node-eventstore/src/provider/mysql.ts:14:38
     private mysql: MySQL;
     private initialized = false;
 
-    constructor(config: MySQLConfig) {
-        this.mysql = new MySQL(config);
-    }
+    constructor(config: MySQLConfig) {}
 
     public async addEvent(stream: Stream, data: any) {

[Killed] ArrayDeclaration
node-eventstore/src/provider/mysql.ts:25:100
             'WHERE streamId = ? AND aggregation = ?',
             [stream.id, stream.aggregation, JSON.stringify(data), stream.id, stream.aggregation]);
 
-        result = await this.mysql.query('SELECT sequence, commitTimestamp FROM events WHERE id=?', [result.insertId]);
+        result = await this.mysql.query('SELECT sequence, commitTimestamp FROM events WHERE id=?', []);
 
         const event: Event = {

[Killed] UnaryOperator
node-eventstore/src/provider/mysql.ts:35:64
         return event;
     }
 
-    public async getEvents(stream: Stream, offset = 0, limit = -1) {
+    public async getEvents(stream: Stream, offset = 0, limit = +1) {
         await this.ensureTables();
         if (limit <= 0) {

[Killed] ConditionalExpression
node-eventstore/src/provider/mysql.ts:37:13
 
     public async getEvents(stream: Stream, offset = 0, limit = -1) {
         await this.ensureTables();
-        if (limit <= 0) {
+        if (true) {
             limit = Number.MAX_SAFE_INTEGER;
         }

[Killed] EqualityOperator
node-eventstore/src/provider/mysql.ts:37:19
 
     public async getEvents(stream: Stream, offset = 0, limit = -1) {
         await this.ensureTables();
-        if (limit <= 0) {
+        if (limit < 0) {
             limit = Number.MAX_SAFE_INTEGER;
         }

[Killed] ArrayDeclaration
node-eventstore/src/provider/mysql.ts:41:13
             limit = Number.MAX_SAFE_INTEGER;
         }
         const result: Array<any> = await this.mysql.query('SELECT * FROM events WHERE streamId=? AND aggregation=? LIMIT ?,?',
-            [stream.id, stream.aggregation, offset, limit]);
+            []);
         return result.map(data => {
             return {

[Killed] UnaryOperator
node-eventstore/src/provider/mysql.ts:51:54
         });
     }
 
-    public async getAggregations(offset = 0, limit = -1): Promise<Array<string>> {
+    public async getAggregations(offset = 0, limit = +1): Promise<Array<string>> {
         await this.ensureTables();
         if (limit <= 0) {

[Killed] ConditionalExpression
node-eventstore/src/provider/mysql.ts:53:13
 
     public async getAggregations(offset = 0, limit = -1): Promise<Array<string>> {
         await this.ensureTables();
-        if (limit <= 0) {
+        if (false) {
             limit = Number.MAX_SAFE_INTEGER;
         }

[Killed] UnaryOperator
node-eventstore/src/provider/mysql.ts:60:70
             [offset, limit]);
     }
 
-    public async getStreams(aggregation: string, offset = 0, limit = -1): Promise<Array<string>> {
+    public async getStreams(aggregation: string, offset = 0, limit = +1): Promise<Array<string>> {
         await this.ensureTables();
         if (limit <= 0) {

[Killed] BlockStatement
node-eventstore/src/provider/mysql.ts:62:25
 
     public async getStreams(aggregation: string, offset = 0, limit = -1): Promise<Array<string>> {
         await this.ensureTables();
-        if (limit <= 0) {
-            limit = Number.MAX_SAFE_INTEGER;
-        }
+        if (limit <= 0) {}
         return await this.mysql.query('SELECT DISTINCT streamId FROM events WHERE aggregation = ? LIMIT ?,?',
             [aggregation, offset, limit]);

[Killed] EqualityOperator
node-eventstore/src/provider/mysql.ts:62:19
 
     public async getStreams(aggregation: string, offset = 0, limit = -1): Promise<Array<string>> {
         await this.ensureTables();
-        if (limit <= 0) {
+        if (limit > 0) {
             limit = Number.MAX_SAFE_INTEGER;
         }

[Killed] ArrayDeclaration
node-eventstore/src/provider/mysql.ts:66:13
             limit = Number.MAX_SAFE_INTEGER;
         }
         return await this.mysql.query('SELECT DISTINCT streamId FROM events WHERE aggregation = ? LIMIT ?,?',
-            [aggregation, offset, limit]);
+            []);
     }
 

[Killed] BooleanLiteral
node-eventstore/src/provider/mysql.ts:70:13
     }
 
     private async ensureTables() {
-        if (!this.initialized) {
+        if (this.initialized) {
             await this.createTables();
             this.initialized = true;

[Killed] BooleanLiteral
node-eventstore/src/provider/mysql.ts:72:32
     private async ensureTables() {
         if (!this.initialized) {
             await this.createTables();
-            this.initialized = true;
+            this.initialized = false;
         }
     }

[Killed] BlockStatement
node-eventstore/src/provider/mysql.ts:76:34
         }
     }
 
-    private async createTables() {
-        await this.mysql.query('CREATE TABLE IF NOT EXISTS events ('
-            + 'id BIGINT NOT NULL AUTO_INCREMENT,'
-            + 'streamId VARCHAR(40) NOT NULL,'
-            + 'aggregation VARCHAR(40) NOT NULL,'
-            + 'payload TEXT,'
-            + 'sequence INT,'
-            + 'commitTimestamp TIMESTAMP DEFAULT CURRENT_TIMESTAMP,'
-            + 'PRIMARY KEY (id),'
-            + 'INDEX AGGREGATION_INDEX(aggregation),'
-            + 'INDEX STREAM_ID_INDEX(streamId)'
-            + ')');
-    }
+    private async createTables() {}
 }
 

[Killed] StringLiteral
node-eventstore/src/provider/mysql.ts:81:15
             + 'id BIGINT NOT NULL AUTO_INCREMENT,'
             + 'streamId VARCHAR(40) NOT NULL,'
             + 'aggregation VARCHAR(40) NOT NULL,'
-            + 'payload TEXT,'
+            + ""
             + 'sequence INT,'
             + 'commitTimestamp TIMESTAMP DEFAULT CURRENT_TIMESTAMP,'

[Killed] StringLiteral
node-eventstore/src/provider/mysql.ts:82:15
             + 'streamId VARCHAR(40) NOT NULL,'
             + 'aggregation VARCHAR(40) NOT NULL,'
             + 'payload TEXT,'
-            + 'sequence INT,'
+            + ""
             + 'commitTimestamp TIMESTAMP DEFAULT CURRENT_TIMESTAMP,'
             + 'PRIMARY KEY (id),'

[Killed] StringLiteral
node-eventstore/src/provider/mysql.ts:87:15
             + 'PRIMARY KEY (id),'
             + 'INDEX AGGREGATION_INDEX(aggregation),'
             + 'INDEX STREAM_ID_INDEX(streamId)'
-            + ')');
+            + "");
     }
 }
