[Killed] ObjectLiteral
src/provider/mysql/connect.ts:6:45
 import * as MySQL from 'mysql';
 import { MySQLConfig } from './config';
 
-const mySQLConfigSchema = Joi.object().keys({
-    cluster: Joi.object(),
-    config: Joi.object()
-}).xor('cluster', 'config');
+const mySQLConfigSchema = Joi.object().keys({}).xor('cluster', 'config');
 
 

[Killed] StringLiteral
src/provider/mysql/connect.ts:9:19
 const mySQLConfigSchema = Joi.object().keys({
     cluster: Joi.object(),
     config: Joi.object()
-}).xor('cluster', 'config');
+}).xor('cluster', "");
 
 

[Killed] ConditionalExpression
src/provider/mysql/connect.ts:18:13
 
         let result: MySQL.PoolCluster | MySQL.Pool;
 
-        if (config.cluster) {
+        if (true) {
             const poolCluster = MySQL.createPoolCluster();
             _.keys(config.cluster).forEach(key => {

[Killed] ConditionalExpression
src/provider/mysql/connect.ts:18:13
 
         let result: MySQL.PoolCluster | MySQL.Pool;
 
-        if (config.cluster) {
+        if (false) {
             const poolCluster = MySQL.createPoolCluster();
             _.keys(config.cluster).forEach(key => {

[Killed] BlockStatement
src/provider/mysql/connect.ts:20:51
 
         if (config.cluster) {
             const poolCluster = MySQL.createPoolCluster();
-            _.keys(config.cluster).forEach(key => {
-                const clusterConfig: MySQL.PoolConfig = config.cluster[key];
-                poolCluster.add(key, clusterConfig);
-            });
+            _.keys(config.cluster).forEach(key => {});
             result = poolCluster;
         } else {

[Killed] BlockStatement
src/provider/mysql/connect.ts:25:16
                 poolCluster.add(key, clusterConfig);
             });
             result = poolCluster;
-        } else {
-            const pool = MySQL.createPool(config.config);
-            result = pool;
-        }
+        } else {}
 
         return result;

[Killed] ConditionalExpression
src/provider/mysql/connect.ts:35:13
 
     private static validateParams(config: MySQLConfig) {
         const result = Joi.validate(config, mySQLConfigSchema);
-        if (result.error) {
+        if (false) {
             throw result.error;
         }

[Killed] BlockStatement
src/provider/mysql/connect.ts:35:27
 
     private static validateParams(config: MySQLConfig) {
         const result = Joi.validate(config, mySQLConfigSchema);
-        if (result.error) {
-            throw result.error;
-        }
+        if (result.error) {}
         return result.value;
     }
