[Timeout] BlockStatement
src/provider/mysql/mysql.ts:15:58
 
     public query(sql: string, args?: any) {
         return new Promise<any>((resolve, reject) => {
-            this.pool.getConnection((err, connection) => {
-                if (err) {
-                    return reject(err);
-                }
-                connection.query(sql, args || [], (e, rows) => {
-                    connection.release();
-                    if (e) {
-                        return reject(e);
-                    }
-                    resolve(rows);
-                });
-            });
+            this.pool.getConnection((err, connection) => {});
         });
     }

[Killed] ConditionalExpression
src/provider/mysql/mysql.ts:16:21
     public query(sql: string, args?: any) {
         return new Promise<any>((resolve, reject) => {
             this.pool.getConnection((err, connection) => {
-                if (err) {
+                if (false) {
                     return reject(err);
                 }

[Killed] ConditionalExpression
src/provider/mysql/mysql.ts:16:21
     public query(sql: string, args?: any) {
         return new Promise<any>((resolve, reject) => {
             this.pool.getConnection((err, connection) => {
-                if (err) {
+                if (true) {
                     return reject(err);
                 }

[Killed] ConditionalExpression
src/provider/mysql/mysql.ts:19:39
                 if (err) {
                     return reject(err);
                 }
-                connection.query(sql, args || [], (e, rows) => {
+                connection.query(sql, true, (e, rows) => {
                     connection.release();
                     if (e) {

[Killed] LogicalOperator
src/provider/mysql/mysql.ts:19:44
                 if (err) {
                     return reject(err);
                 }
-                connection.query(sql, args || [], (e, rows) => {
+                connection.query(sql, args && [], (e, rows) => {
                     connection.release();
                     if (e) {

[Killed] ConditionalExpression
src/provider/mysql/mysql.ts:21:25
                 }
                 connection.query(sql, args || [], (e, rows) => {
                     connection.release();
-                    if (e) {
+                    if (true) {
                         return reject(e);
                     }

[Killed] BlockStatement
src/provider/mysql/mysql.ts:21:28
                 }
                 connection.query(sql, args || [], (e, rows) => {
                     connection.release();
-                    if (e) {
-                        return reject(e);
-                    }
+                    if (e) {}
                     resolve(rows);
                 });
