[Killed] ArithmeticOperator
node-eventstore/src/provider/redis.ts:19:109
     }
 
     public async addEvent(stream: Stream, data: any) {
-        const sequence = await this.redis.incr(`sequences:{${this.getKey(stream.aggregation, stream.id)}}`) - 1;
+        const sequence = await this.redis.incr(`sequences:{${this.getKey(stream.aggregation, stream.id)}}`) + 1;
         const time = await this.redis.time();
         const commitTimestamp = parseInt(time, 10);

[Killed] StringLiteral
node-eventstore/src/provider/redis.ts:19:48
     }
 
     public async addEvent(stream: Stream, data: any) {
-        const sequence = await this.redis.incr(`sequences:{${this.getKey(stream.aggregation, stream.id)}}`) - 1;
+        const sequence = await this.redis.incr("") - 1;
         const time = await this.redis.time();
         const commitTimestamp = parseInt(time, 10);

[Killed] ArrowFunction
node-eventstore/src/provider/redis.ts:37:28
 
     public async getEvents(stream: Stream, offset = 0, limit = -1) {
         const history: Array<string> = await this.redis.lrange(this.getKey(stream.aggregation, stream.id), offset, limit);
-        return history.map(data => JSON.parse(data));
+        return history.map(() => undefined);
     }
 
