[Killed] BooleanLiteral
node-eventstore/src/publisher/memory.ts:15:24
 
     public async publish(message: Message) {
         const aggregationListeners = this.listeners.get(message.stream.aggregation);
-        let notified = false;
+        let notified = true;
         if (aggregationListeners != null && aggregationListeners.length) {
             notified = true;

[Killed] ConditionalExpression
node-eventstore/src/publisher/memory.ts:16:13
     public async publish(message: Message) {
         const aggregationListeners = this.listeners.get(message.stream.aggregation);
         let notified = false;
-        if (aggregationListeners != null && aggregationListeners.length) {
+        if (false) {
             notified = true;
             aggregationListeners.forEach(subscriber => subscriber(message));

[Killed] ConditionalExpression
node-eventstore/src/publisher/memory.ts:16:13
     public async publish(message: Message) {
         const aggregationListeners = this.listeners.get(message.stream.aggregation);
         let notified = false;
-        if (aggregationListeners != null && aggregationListeners.length) {
+        if (true) {
             notified = true;
             aggregationListeners.forEach(subscriber => subscriber(message));

[Killed] BooleanLiteral
node-eventstore/src/publisher/memory.ts:17:24
         const aggregationListeners = this.listeners.get(message.stream.aggregation);
         let notified = false;
         if (aggregationListeners != null && aggregationListeners.length) {
-            notified = true;
+            notified = false;
             aggregationListeners.forEach(subscriber => subscriber(message));
         }

[Killed] ArrowFunction
node-eventstore/src/publisher/memory.ts:18:42
         let notified = false;
         if (aggregationListeners != null && aggregationListeners.length) {
             notified = true;
-            aggregationListeners.forEach(subscriber => subscriber(message));
+            aggregationListeners.forEach(() => undefined);
         }
         return notified;

[Killed] BooleanLiteral
node-eventstore/src/publisher/memory.ts:25:13
 
     public async subscribe(aggregation: string, subscriber: Subscriber): Promise<Subscription> {
         let aggregateListeners = this.listeners.get(aggregation);
-        if (!aggregateListeners) {
+        if (aggregateListeners) {
             aggregateListeners = new Array<Subscriber>();
             this.listeners.set(aggregation, aggregateListeners);

[Killed] ConditionalExpression
node-eventstore/src/publisher/memory.ts:25:13
 
     public async subscribe(aggregation: string, subscriber: Subscriber): Promise<Subscription> {
         let aggregateListeners = this.listeners.get(aggregation);
-        if (!aggregateListeners) {
+        if (true) {
             aggregateListeners = new Array<Subscriber>();
             this.listeners.set(aggregation, aggregateListeners);

[Killed] BlockStatement
node-eventstore/src/publisher/memory.ts:31:33
         }
         aggregateListeners.push(subscriber);
         return {
-            remove: async () => {
-                const index = aggregateListeners.indexOf(subscriber);
-                aggregateListeners.splice(index, 1);
-            }
+            remove: async () => {}
         };
     }
