[Killed] BlockStatement
node-eventstore/src/publisher/rabbitmq.ts:13:30
     private url: string;
     private exchanges: Set<string> = new Set();
 
-    constructor(url: string) {
-        this.url = url;
-    }
+    constructor(url: string) {}
 
     public async publish(message: Message) {

[Killed] StringLiteral
node-eventstore/src/publisher/rabbitmq.ts:20:66
     public async publish(message: Message) {
         const channel = await this.getChannel();
         await this.ensureExchange(message.stream.aggregation, channel);
-        return await channel.publish(message.stream.aggregation, '', Buffer.from(JSON.stringify(message)));
+        return await channel.publish(message.stream.aggregation, "Stryker was here!", Buffer.from(JSON.stringify(message)));
     }
 

[Killed] BooleanLiteral
node-eventstore/src/publisher/rabbitmq.ts:27:62
         const channel = await this.getChannel();
         await this.ensureExchange(aggregation, channel);
 
-        const q = await channel.assertQueue('', { exclusive: true });
+        const q = await channel.assertQueue('', { exclusive: false });
         channel.bindQueue(q.queue, aggregation, '');
         const response = await channel.consume(q.queue, (msg) => {

[Killed] ObjectLiteral
node-eventstore/src/publisher/rabbitmq.ts:27:49
         const channel = await this.getChannel();
         await this.ensureExchange(aggregation, channel);
 
-        const q = await channel.assertQueue('', { exclusive: true });
+        const q = await channel.assertQueue('', {});
         channel.bindQueue(q.queue, aggregation, '');
         const response = await channel.consume(q.queue, (msg) => {

[Killed] BlockStatement
node-eventstore/src/publisher/rabbitmq.ts:29:66
 
         const q = await channel.assertQueue('', { exclusive: true });
         channel.bindQueue(q.queue, aggregation, '');
-        const response = await channel.consume(q.queue, (msg) => {
-            subscriber(JSON.parse(msg.content.toString()));
-        }, { noAck: true });
+        const response = await channel.consume(q.queue, (msg) => {}, { noAck: true });
         const consumerTag = response.consumerTag;
 

[Killed] BooleanLiteral
node-eventstore/src/publisher/rabbitmq.ts:31:21
         channel.bindQueue(q.queue, aggregation, '');
         const response = await channel.consume(q.queue, (msg) => {
             subscriber(JSON.parse(msg.content.toString()));
-        }, { noAck: true });
+        }, { noAck: false });
         const consumerTag = response.consumerTag;
 

[Killed] ConditionalExpression
node-eventstore/src/publisher/rabbitmq.ts:43:13
     }
 
     private async ensureExchange(aggregation: string, channel: amqp.Channel) {
-        if (!this.exchanges.has(aggregation)) {
+        if (true) {
             await channel.assertExchange(aggregation, 'fanout', { durable: false });
             this.exchanges.add(aggregation);

[Killed] BooleanLiteral
node-eventstore/src/publisher/rabbitmq.ts:43:13
     }
 
     private async ensureExchange(aggregation: string, channel: amqp.Channel) {
-        if (!this.exchanges.has(aggregation)) {
+        if (this.exchanges.has(aggregation)) {
             await channel.assertExchange(aggregation, 'fanout', { durable: false });
             this.exchanges.add(aggregation);

[Killed] BooleanLiteral
node-eventstore/src/publisher/rabbitmq.ts:44:76
 
     private async ensureExchange(aggregation: string, channel: amqp.Channel) {
         if (!this.exchanges.has(aggregation)) {
-            await channel.assertExchange(aggregation, 'fanout', { durable: false });
+            await channel.assertExchange(aggregation, 'fanout', { durable: true });
             this.exchanges.add(aggregation);
         }

[Killed] ObjectLiteral
node-eventstore/src/publisher/rabbitmq.ts:44:65
 
     private async ensureExchange(aggregation: string, channel: amqp.Channel) {
         if (!this.exchanges.has(aggregation)) {
-            await channel.assertExchange(aggregation, 'fanout', { durable: false });
+            await channel.assertExchange(aggregation, 'fanout', {});
             this.exchanges.add(aggregation);
         }

[Killed] BooleanLiteral
node-eventstore/src/publisher/rabbitmq.ts:50:13
     }
 
     private async getChannel() {
-        if (!this.channel) {
+        if (this.channel) {
             const conn = await amqp.connect(this.url);
             this.channel = await conn.createChannel();

[Killed] ConditionalExpression
node-eventstore/src/publisher/rabbitmq.ts:50:13
     }
 
     private async getChannel() {
-        if (!this.channel) {
+        if (false) {
             const conn = await amqp.connect(this.url);
             this.channel = await conn.createChannel();
