[Killed] BooleanLiteral
node-eventstore/src/publisher/redis.ts:14:31
     private redisSubscriber: Redis;
     private redisPublisher: Redis;
     private listeners: Map<string, Array<Subscriber>> = new Map();
-    private listenningRedis = false;
+    private listenningRedis = true;
 
     constructor(config: RedisConfig) {

[Killed] EqualityOperator
node-eventstore/src/publisher/redis.ts:23:26
 
     public async publish(message: Message) {
         const listeners = await this.redisPublisher.publish(message.stream.aggregation, JSON.stringify(message));
-        return listeners > 0;
+        return listeners >= 0;
     }
 

[Killed] EqualityOperator
node-eventstore/src/publisher/redis.ts:23:26
 
     public async publish(message: Message) {
         const listeners = await this.redisPublisher.publish(message.stream.aggregation, JSON.stringify(message));
-        return listeners > 0;
+        return listeners <= 0;
     }
 

[Killed] ConditionalExpression
node-eventstore/src/publisher/redis.ts:28:13
 
     public async subscribe(aggregation: string, subscriber: Subscriber): Promise<Subscription> {
         let subscribers = this.listeners.get(aggregation);
-        if (!subscribers) {
+        if (true) {
             subscribers = new Array<Subscriber>();
             this.listeners.set(aggregation, subscribers);

[Killed] ConditionalExpression
node-eventstore/src/publisher/redis.ts:28:13
 
     public async subscribe(aggregation: string, subscriber: Subscriber): Promise<Subscription> {
         let subscribers = this.listeners.get(aggregation);
-        if (!subscribers) {
+        if (false) {
             subscribers = new Array<Subscriber>();
             this.listeners.set(aggregation, subscribers);

[Killed] BlockStatement
node-eventstore/src/publisher/redis.ts:37:48
         await this.registerRedisListener();
 
         return {
-            remove: async (): Promise<void> => {
-                const index = subscribers.indexOf(subscriber);
-                subscribers.splice(index, 1);
-                if (subscribers.length === 0) {
-                    this.redisSubscriber.unsubscribe(aggregation);
-                }
-            }
+            remove: async (): Promise<void> => {}
         };
     }

[Killed] ConditionalExpression
node-eventstore/src/publisher/redis.ts:40:21
             remove: async (): Promise<void> => {
                 const index = subscribers.indexOf(subscriber);
                 subscribers.splice(index, 1);
-                if (subscribers.length === 0) {
+                if (false) {
                     this.redisSubscriber.unsubscribe(aggregation);
                 }

[Killed] EqualityOperator
node-eventstore/src/publisher/redis.ts:40:40
             remove: async (): Promise<void> => {
                 const index = subscribers.indexOf(subscriber);
                 subscribers.splice(index, 1);
-                if (subscribers.length === 0) {
+                if (subscribers.length !== 0) {
                     this.redisSubscriber.unsubscribe(aggregation);
                 }

[Killed] BooleanLiteral
node-eventstore/src/publisher/redis.ts:48:13
     }
 
     private async registerRedisListener() {
-        if (!this.listenningRedis) {
+        if (this.listenningRedis) {
             this.listenningRedis = true;
             await this.redisSubscriber.on('message', (aggregation, received) => {

[Killed] BlockStatement
node-eventstore/src/publisher/redis.ts:48:36
     }
 
     private async registerRedisListener() {
-        if (!this.listenningRedis) {
-            this.listenningRedis = true;
-            await this.redisSubscriber.on('message', (aggregation, received) => {
-                const message: Message = JSON.parse(received);
-                const subscribers = this.listeners.get(aggregation);
-                subscribers.forEach(subscriber => subscriber(message));
-            });
-        }
+        if (!this.listenningRedis) {}
     }
 }

[Killed] BooleanLiteral
node-eventstore/src/publisher/redis.ts:49:36
 
     private async registerRedisListener() {
         if (!this.listenningRedis) {
-            this.listenningRedis = true;
+            this.listenningRedis = false;
             await this.redisSubscriber.on('message', (aggregation, received) => {
                 const message: Message = JSON.parse(received);

[Killed] BlockStatement
node-eventstore/src/publisher/redis.ts:50:81
     private async registerRedisListener() {
         if (!this.listenningRedis) {
             this.listenningRedis = true;
-            await this.redisSubscriber.on('message', (aggregation, received) => {
-                const message: Message = JSON.parse(received);
-                const subscribers = this.listeners.get(aggregation);
-                subscribers.forEach(subscriber => subscriber(message));
-            });
+            await this.redisSubscriber.on('message', (aggregation, received) => {});
         }
     }

[Killed] StringLiteral
node-eventstore/src/publisher/redis.ts:50:43
     private async registerRedisListener() {
         if (!this.listenningRedis) {
             this.listenningRedis = true;
-            await this.redisSubscriber.on('message', (aggregation, received) => {
+            await this.redisSubscriber.on("", (aggregation, received) => {
                 const message: Message = JSON.parse(received);
                 const subscribers = this.listeners.get(aggregation);
