[Killed] ObjectLiteral
node-eventstore/src/redis/connect.ts:20:33
         keyPrefix: Joi.string(),
         password: Joi.string()
     }),
-    sentinel: Joi.object().keys({
-        name: Joi.string().required(),
-        nodes: Joi.alternatives([Joi.array().items(redisNodeSchema), redisNodeSchema]).required()
-    }),
+    sentinel: Joi.object().keys({}),
     standalone: redisNodeSchema
 }).xor('standalone', 'sentinel', 'cluster');

[Killed] StringLiteral
node-eventstore/src/redis/connect.ts:25:22
         nodes: Joi.alternatives([Joi.array().items(redisNodeSchema), redisNodeSchema]).required()
     }),
     standalone: redisNodeSchema
-}).xor('standalone', 'sentinel', 'cluster');
+}).xor('standalone', "", 'cluster');
 
 

[Killed] ObjectLiteral
node-eventstore/src/redis/connect.ts:33:37
         config = RedisFactory.validateParams(config);
         let client;
 
-        config = _.defaults(config, {
-            options: {}
-        });
+        config = _.defaults(config, {});
 
         if (config.cluster) {

[Killed] BlockStatement
node-eventstore/src/redis/connect.ts:37:29
             options: {}
         });
 
-        if (config.cluster) {
-            config.cluster.forEach(node => {
-                node.port = _.toSafeInteger(node.port);
-            });
-            client = new Redis.Cluster(config.cluster as any, {
-                redisOptions: config.options,
-                scaleReads: 'all'
-            });
-        } else if (config.sentinel) {
+        if (config.cluster) {} else if (config.sentinel) {
             const params = _.defaults(config.options, {
                 name: config.sentinel.name,

[Killed] BlockStatement
node-eventstore/src/redis/connect.ts:38:44
         });
 
         if (config.cluster) {
-            config.cluster.forEach(node => {
-                node.port = _.toSafeInteger(node.port);
-            });
+            config.cluster.forEach(node => {});
             client = new Redis.Cluster(config.cluster as any, {
                 redisOptions: config.options,

[Killed] StringLiteral
node-eventstore/src/redis/connect.ts:43:29
             });
             client = new Redis.Cluster(config.cluster as any, {
                 redisOptions: config.options,
-                scaleReads: 'all'
+                scaleReads: ""
             });
         } else if (config.sentinel) {

[Killed] ConditionalExpression
node-eventstore/src/redis/connect.ts:45:20
                 redisOptions: config.options,
                 scaleReads: 'all'
             });
-        } else if (config.sentinel) {
+        } else if (true) {
             const params = _.defaults(config.options, {
                 name: config.sentinel.name,

[Killed] BlockStatement
node-eventstore/src/redis/connect.ts:45:37
                 redisOptions: config.options,
                 scaleReads: 'all'
             });
-        } else if (config.sentinel) {
-            const params = _.defaults(config.options, {
-                name: config.sentinel.name,
-                sentinels: config.sentinel.nodes
-            });
-            config.sentinel.nodes.forEach(node => {
-                node.port = _.toSafeInteger(node.port);
-            });
-            client = new Redis(params);
-        } else {
+        } else if (config.sentinel) {} else {
             config.standalone = _.defaults(config.standalone, {
                 port: 6379

[Killed] BlockStatement
node-eventstore/src/redis/connect.ts:50:51
                 name: config.sentinel.name,
                 sentinels: config.sentinel.nodes
             });
-            config.sentinel.nodes.forEach(node => {
-                node.port = _.toSafeInteger(node.port);
-            });
+            config.sentinel.nodes.forEach(node => {});
             client = new Redis(params);
         } else {

[Killed] BlockStatement
node-eventstore/src/redis/connect.ts:54:16
                 node.port = _.toSafeInteger(node.port);
             });
             client = new Redis(params);
-        } else {
-            config.standalone = _.defaults(config.standalone, {
-                port: 6379
-            });
-
-            config.options.password = config.standalone.password;
-
-            client = new Redis(_.toSafeInteger(config.standalone.port),
-                config.standalone.host, config.options);
-        }
+        } else {}
 
         return client;

[Killed] ObjectLiteral
node-eventstore/src/redis/connect.ts:55:63
             });
             client = new Redis(params);
         } else {
-            config.standalone = _.defaults(config.standalone, {
-                port: 6379
-            });
+            config.standalone = _.defaults(config.standalone, {});
 
             config.options.password = config.standalone.password;

[Killed] ConditionalExpression
node-eventstore/src/redis/connect.ts:70:13
 
     private static validateParams(config: RedisConfig) {
         const result = Joi.validate(config, redisConfigSchema);
-        if (result.error) {
+        if (true) {
             throw result.error;
         }

[Killed] ConditionalExpression
node-eventstore/src/redis/connect.ts:70:13
 
     private static validateParams(config: RedisConfig) {
         const result = Joi.validate(config, redisConfigSchema);
-        if (result.error) {
+        if (false) {
             throw result.error;
         }
