[Killed] ConditionalExpression
thiagobustamante/node-eventstore/src/event-stream.ts:52:13
      */
     public async addEvent(data: any, type?: string) {
         const addedEvent: Event = await this.getProvider().addEvent(this.stream, data, type);
-        if (this.eventStore.publisher) {
+        if (true) {
             await (this.eventStore.publisher as Publisher).publish({
                 event: addedEvent,

[Killed] ConditionalExpression
thiagobustamante/node-eventstore/src/event-stream.ts:52:13
      */
     public async addEvent(data: any, type?: string) {
         const addedEvent: Event = await this.getProvider().addEvent(this.stream, data, type);
-        if (this.eventStore.publisher) {
+        if (false) {
             await (this.eventStore.publisher as Publisher).publish({
                 event: addedEvent,
