[Killed] ConditionalExpression
node-eventstore/src/provider/memory.ts:37:13
 
     public async getStreams(aggregation: string, offset = 0, limit?: number): Promise<Array<string>> {
         const streams = this.store.get(aggregation);
-        if (streams) {
+        if (true) {
             const keys = Array.from(streams.keys());
             return _(keys).sort().drop(offset).take(limit || this.store.size).value();

[Killed] BooleanLiteral
node-eventstore/src/provider/memory.ts:46:13
 
     private getEventsList(aggregation: string, streamId: string) {
         let streams = this.store.get(aggregation);
-        if (!streams) {
+        if (streams) {
             streams = new Map<string, Array<Event>>();
             this.store.set(aggregation, streams);

[Killed] BlockStatement
node-eventstore/src/provider/memory.ts:51:23
             this.store.set(aggregation, streams);
         }
         let history = streams.get(streamId);
-        if (!history) {
-            history = new Array<Event>();
-            streams.set(streamId, history);
-        }
+        if (!history) {}
         return history;
     }
