[Killed] ArithmeticOperator
node-eventstore/src/provider/mongo.ts:22:102
 
     public async addEvent(stream: Stream, data: any, type = '') {
         const events = await this.events();
-        const sequence = await this.getNextSequenceValue(this.getKey(stream.aggregation, stream.id)) - 1;
+        const sequence = await this.getNextSequenceValue(this.getKey(stream.aggregation, stream.id)) + 1;
         const commitTimestamp = new Date().getTime();
         const event: Event = {

[Killed] StringLiteral
node-eventstore/src/provider/mongo.ts:33:29
 
         const result = await events.insertOne(_.merge(event, { stream: stream }));
         if (!result.result.ok) {
-            throw new Error('Error saving event into the store');
+            throw new Error("");
         }
 

[Killed] StringLiteral
node-eventstore/src/provider/mongo.ts:41:38
 
     public async getEvents(stream: Stream, offset = 0, limit = 0) {
         const events = await this.events();
-        const cursor = events.find({ 'stream.id': stream.id, 'stream.aggregation': stream.aggregation });
+        const cursor = events.find({ "": stream.id, 'stream.aggregation': stream.aggregation });
         if (offset > 0) {
             cursor.skip(offset);

[Killed] EqualityOperator
node-eventstore/src/provider/mongo.ts:42:20
     public async getEvents(stream: Stream, offset = 0, limit = 0) {
         const events = await this.events();
         const cursor = events.find({ 'stream.id': stream.id, 'stream.aggregation': stream.aggregation });
-        if (offset > 0) {
+        if (offset <= 0) {
             cursor.skip(offset);
         }

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:45:13
         if (offset > 0) {
             cursor.skip(offset);
         }
-        if (limit > 0) {
+        if (true) {
             cursor.limit(limit);
         }

[Killed] StringLiteral
node-eventstore/src/provider/mongo.ts:54:56
 
     public async getAggregations(offset = 0, limit = 0): Promise<Array<string>> {
         const events = await this.events();
-        const cursor = events.aggregate().group({ _id: '$stream.aggregation' });
+        const cursor = events.aggregate().group({ _id: "" });
 
         if (offset > 0) {

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:56:13
         const events = await this.events();
         const cursor = events.aggregate().group({ _id: '$stream.aggregation' });
 
-        if (offset > 0) {
+        if (false) {
             cursor.skip(offset);
         }

[Killed] EqualityOperator
node-eventstore/src/provider/mongo.ts:75:19
         if (offset > 0) {
             cursor.skip(offset);
         }
-        if (limit > 0) {
+        if (limit <= 0) {
             cursor.limit(limit);
         }

[Killed] StringLiteral
node-eventstore/src/provider/mongo.ts:83:16
     }
 
     private getKey(aggregation: string, streamId: string): string {
-        return `${aggregation}:${streamId}`;
+        return "";
     }
 

[Killed] BooleanLiteral
node-eventstore/src/provider/mongo.ts:87:13
     }
 
     private async events() {
-        if (!this.eventCollection) {
+        if (this.eventCollection) {
             const mongoClient = await this.getMongoClient();
             this.eventCollection = mongoClient.db().collection('events');

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:95:13
     }
 
     private async counters() {
-        if (!this.countersCollection) {
+        if (false) {
             const mongoClient = await this.getMongoClient();
             this.countersCollection = mongoClient.db().collection('counters');

[Killed] ConditionalExpression
node-eventstore/src/provider/mongo.ts:95:13
     }
 
     private async counters() {
-        if (!this.countersCollection) {
+        if (true) {
             const mongoClient = await this.getMongoClient();
             this.countersCollection = mongoClient.db().collection('counters');

[Killed] ObjectLiteral
node-eventstore/src/provider/mongo.ts:112:13
     private async getNextSequenceValue(sequenceName: string) {
         const counters = await this.counters();
         const result = await counters.findOneAndUpdate(
-            { _id: sequenceName },
+            {},
             // eslint-disable-next-line @typescript-eslint/camelcase
             { $inc: { sequence_value: 1 } },
