[Killed] StringLiteral
node-eventstore/src/provider/mysql.ts:58:39
         if (limit <= 0) {
             limit = Number.MAX_SAFE_INTEGER;
         }
-        return await this.mysql.query('SELECT DISTINCT aggregation FROM events LIMIT ?,?',
+        return await this.mysql.query("",
             [offset, limit]);
     }

[Killed] StringLiteral
node-eventstore/src/provider/mysql.ts:67:39
         if (limit <= 0) {
             limit = Number.MAX_SAFE_INTEGER;
         }
-        return await this.mysql.query('SELECT DISTINCT streamId FROM events WHERE aggregation = ? LIMIT ?,?',
+        return await this.mysql.query("",
             [aggregation, offset, limit]);
     }

[Killed] BlockStatement
node-eventstore/src/provider/mysql.ts:78:34
         }
     }
 
-    private async createTables() {
-        await this.mysql.query('CREATE TABLE IF NOT EXISTS events ('
-            + 'id BIGINT NOT NULL AUTO_INCREMENT,'
-            + 'streamId VARCHAR(40) NOT NULL,'
-            + 'aggregation VARCHAR(40) NOT NULL,'
-            + 'payload TEXT,'
-            + 'type VARCHAR(40),'
-            + 'sequence INT,'
-            + 'commitTimestamp TIMESTAMP DEFAULT CURRENT_TIMESTAMP,'
-            + 'PRIMARY KEY (id),'
-            + 'INDEX AGGREGATION_INDEX(aggregation),'
-            + 'INDEX STREAM_ID_INDEX(streamId)'
-            + ')');
-    }
+    private async createTables() {}
 }
 

[Killed] StringLiteral
node-eventstore/src/provider/mysql.ts:79:32
     }
 
     private async createTables() {
-        await this.mysql.query('CREATE TABLE IF NOT EXISTS events ('
+        await this.mysql.query(""
             + 'id BIGINT NOT NULL AUTO_INCREMENT,'
             + 'streamId VARCHAR(40) NOT NULL,'

[Killed] StringLiteral
node-eventstore/src/provider/mysql.ts:81:15
     private async createTables() {
         await this.mysql.query('CREATE TABLE IF NOT EXISTS events ('
             + 'id BIGINT NOT NULL AUTO_INCREMENT,'
-            + 'streamId VARCHAR(40) NOT NULL,'
+            + ""
             + 'aggregation VARCHAR(40) NOT NULL,'
             + 'payload TEXT,'

[Killed] StringLiteral
node-eventstore/src/provider/mysql.ts:82:15
         await this.mysql.query('CREATE TABLE IF NOT EXISTS events ('
             + 'id BIGINT NOT NULL AUTO_INCREMENT,'
             + 'streamId VARCHAR(40) NOT NULL,'
-            + 'aggregation VARCHAR(40) NOT NULL,'
+            + ""
             + 'payload TEXT,'
             + 'type VARCHAR(40),'

[Killed] StringLiteral
node-eventstore/src/provider/mysql.ts:87:15
             + 'type VARCHAR(40),'
             + 'sequence INT,'
             + 'commitTimestamp TIMESTAMP DEFAULT CURRENT_TIMESTAMP,'
-            + 'PRIMARY KEY (id),'
+            + ""
             + 'INDEX AGGREGATION_INDEX(aggregation),'
             + 'INDEX STREAM_ID_INDEX(streamId)'

[Killed] StringLiteral
node-eventstore/src/provider/mysql.ts:88:15
             + 'sequence INT,'
             + 'commitTimestamp TIMESTAMP DEFAULT CURRENT_TIMESTAMP,'
             + 'PRIMARY KEY (id),'
-            + 'INDEX AGGREGATION_INDEX(aggregation),'
+            + ""
             + 'INDEX STREAM_ID_INDEX(streamId)'
             + ')');

[Killed] StringLiteral
node-eventstore/src/provider/mysql.ts:89:15
             + 'commitTimestamp TIMESTAMP DEFAULT CURRENT_TIMESTAMP,'
             + 'PRIMARY KEY (id),'
             + 'INDEX AGGREGATION_INDEX(aggregation),'
-            + 'INDEX STREAM_ID_INDEX(streamId)'
+            + ""
             + ')');
     }
