[Killed] StringLiteral
node-eventstore/src/provider/redis.ts:18:61
         this.redis = RedisFactory.createClient(config);
     }
 
-    public async addEvent(stream: Stream, data: any, type = '') {
+    public async addEvent(stream: Stream, data: any, type = "Stryker was here!") {
         const sequence = await this.redis.incr(`sequences:{${this.getKey(stream.aggregation, stream.id)}}`) - 1;
         const time = await this.redis.time();

[Killed] ArithmeticOperator
node-eventstore/src/provider/redis.ts:19:109
     }
 
     public async addEvent(stream: Stream, data: any, type = '') {
-        const sequence = await this.redis.incr(`sequences:{${this.getKey(stream.aggregation, stream.id)}}`) - 1;
+        const sequence = await this.redis.incr(`sequences:{${this.getKey(stream.aggregation, stream.id)}}`) + 1;
         const time = await this.redis.time();
         const commitTimestamp = parseInt(time, 10);

[Killed] StringLiteral
node-eventstore/src/provider/redis.ts:19:48
     }
 
     public async addEvent(stream: Stream, data: any, type = '') {
-        const sequence = await this.redis.incr(`sequences:{${this.getKey(stream.aggregation, stream.id)}}`) - 1;
+        const sequence = await this.redis.incr("") - 1;
         const time = await this.redis.time();
         const commitTimestamp = parseInt(time, 10);

[Killed] StringLiteral
node-eventstore/src/provider/redis.ts:31:19
         await this.redis.multi()
             .rpush(this.getKey(stream.aggregation, stream.id), JSON.stringify(event))
             .zadd(`meta:aggregations:${stream.aggregation}`, '1', stream.id)
-            .zadd('meta:aggregations', '1', stream.aggregation)
+            .zadd("", '1', stream.aggregation)
             .exec();
         return event;

[Killed] StringLiteral
node-eventstore/src/provider/redis.ts:42:69
     }
 
     public async getAggregations(offset = 0, limit = -1): Promise<Array<string>> {
-        const aggregations: Array<string> = await this.redis.zrange('meta:aggregations', offset, limit);
+        const aggregations: Array<string> = await this.redis.zrange("", offset, limit);
         return aggregations;
     }
